<h1>Часто задаваемые вопросы</h1>
  
  <h3> Дополнительные источники информации</h3>
  <ul><li><a href="/whatis.html">Прочтите сначала: Что такое Фринет?</a>
  </li><li><a href="https://wiki.freenetproject.org/FAQ">Другой FAQ на нашем сервере wiki</a>
  </li><li><a href="https://wiki.freenetproject.org/Security_summary">Страница посвященная безопасности Фринет 0.7 на нашем сервере wiki</a>
  </li><li><a href="/image/rabbit/freenet-bunny.svg">Высококачественная копия значка кролика</a>
  </li></ul>
  
  <h3> Философские вопросы</h3>
  <ol><li><a href="#what">Что такое Фринет?</a>
  </li><li><a href="#tor">Чем Фринет отличается от Tor? Могу ли я получить доступ к Google/Facebook и другим ресурсам через Фринет?</a>
  </li><li><a href="#who">Кто стоит за Фринет?</a>
  </li><li><a href="#trust">Как можно доверять информации анонимных авторов?</a>
  </li><li><a href="#donate-bw">Должен ли я предоставлять дисковое пространство и трафик?</a>
  </li><li><a href="#leech">У меня нет ресурсов, которыми я мог бы поделиться с сетью и я хочу загружать больше.</a>
  </li><li><a href="#donate-more-bw">Все мои друзья предоставляют сети очень мало дискового пространства и пропускной способности своего канала. Зачем мне предоставлять больше ресурсов?</a>
  </li><li><a href="#donate-lot">Если я предоставлю много ресурсов, существенно ли улучшится мои впечатления от работы Фринет?</a>
  </li><li><a href="#legal">Легальность Фринет.</a>
  </li><li><a href="#blocked">Блокируется ли Фринет национальными брандмауэрами?</a>
  </li><li><a href="#trouble">Могут ли у меня быть неприятности, если я поднял нод-узел?</a>
  </li><li><a href="#copyright">Об авторском праве.</a>
  </li><li><a href="#childporn">Как насчет детского порно, материалов оскорбительного содержания или терроризма?</a>
  </li><li><a href="#offensive">Я не хочу, чтобы мой нод-узел использовался для «скрытого» хранения детского порно, материалов оскорбительного содержания или чего-нибудь связанного с терроризмом. Что я могу сделать?</a>
  </li><li><a href="#export">Что насчет экспортных ограничений шифрования?</a>
  </li><li><a href="#whatelse">Мне нечего скрывать и я не нуждаюсь в анонимности. Есть что-нибудь еще, что Фринет может мне предложить?</a>
  </li></ol>
  
  <h3> Технические вопросы</h3>
  <ol><li><a href="#how">Как я могу использовать программное обеспечение? Я загрузил его и запустил, но не вижу графического интерфейса.</a>
  </li><li><a href="#slow">Почему Фринет такой медленный?</a>
  </li><li><a href="#search">Работает ли поиск в сети Фринет?</a>
  </li><li><a href="#firewall">Как настроить Фринет для работы за брандмауэром/NAT?</a>
  </li><li><a href="#connection-perm">Требуется ли постоянное подключение к сети для запуска нод узла?</a>
  </li><li><a href="#connections">Почему клиент Фринет загружает только 1 или 2 файла одновременно?</a>
  </li><li><a href="#store-perm">Почему Фринет не может хранить данные постоянно?</a>
  </li><li><a href="#why-java">Почему Фринет реализуется на Java?</a>
  </li><li><a href="#fproxy-lan">Как разрешить подключения к FProxy с других компьютеров?</a>
  </li><li><a href="#openjdk">Установщик вылетает при скачивании файлов и я использую Ubuntu 8.04 и/или OpenJDK</a>
  </li><li><a href="#whatsnew">Что нового? Есть ли лог изменений?</a>
  </li><li><a href="#backtrace">Почему так много сообщений в моем лог-файле с приложением трассировки?</a>
  </li><li><a href="#stabchange">Как я могу переключаться между основной и тестовой сетями?</a>
  </li><li><a href="#freenetinigone">Фринет не запускается; говорит, что не может найти freenet.ini.</a>
  </li><li><a href="#servicenotrespond">Фринет не запускается, говорит «служба не ответила на сигнал».</a>
  </li><li><a href="#kaspersky">У меня установлен антивирус Касперского и Фринет не устанавливается или неизменно показывает «База данных очереди загрузок/выгрузок повреждена!».</a>
  </li><li><a href="#forgotpass">Я установил пароль и забыл его. Что я могу сделать?</a>
  </li><li><a href="#clockskew">Фринет постоянно жалуется на искаженное время.</a>
  </li></ol>
  
  <h3> Вопросы связанные с публикацией</h3>
  <ol><li><a href="#find">Если я публикую что-нибудь в сети Фринет, как мою публикацию найдут другие пользователи сети? Не должны ли они знать ключ, который я использовал?</a>
  </li><li><a href="#chk">Как я могу опубликовать хэш-ключ контента (CHK)?</a>
  </li><li><a href="#update">Возможно ли обновлять или удалять документы в сети Фринет?</a>
  </li></ol>
  
  <h3> Вопросы по участию</h3>
  <ol><li><a href="#idea">У меня есть отличная идея…</a>
  </li><li><a href="#contribute">Могу ли я принять участие в проекте Фринет?</a>
  </li><li><a href="#access">Как я могу получить доступ к коду и сайту?</a>
  </li><li><a href="#devtools">Какие инструменты мне потребуются для помощи в разработке?</a>
  </li><li><a href="#freenethelp">Есть ли сайт-помощник с более глубокой информацией по вопросам новичков о Фринет, и как люди могут поучаствовать в проекте?</a>
  </li><li><a href="#bugs">Где я могу сообщать об ошибках?</a>
  </li><li><a href="#theory">Я компьютерный ученый/математик, как я могу помочь?</a>
  </li></ol>
  
  <h3> Вопросы по безопасности</h3>
  <ol><li><a href="#browser">Могу ли я обозревать Фринет моим обычным браузером?</a>
  </li><li><a href="#attack">Не нарушит ли атака Х анонимность Фринет?</a>
  </li><li><a href="#flooding">Уязвим ли Фринет к флуд-атакам?</a>
  </li><li><a href="#hash">Для чего нужны хэш-ключи и шифрование данных, если оператор нод-узла может идентифицировать их (данные) в любом случае, если он попытается?</a>
  </li><li><a href="#cancer">Что насчет враждебных «раковых» нод-узлов в сети?</a>
  </li><li><a href="#attackY">Что насчет атаки Y?</a>
  </li><li><a href="#privatedata">Что личная информация делает в хранилище Фринет? Как мне избавиться от этого? Как я могу защитить мои компьютер и безопасность при работе в сети Фринет?</a>
  </li><li><a href="#smartscreen">Фильтр Windows SmartScreen предупреждает, что установщик может нанести вред компьютеру. Что происходит?</a>
  </li></ol>
      
  <h2> Философские ответы</h2>
  
  <p><b id="what">Что такое Фринет?</b><br>
  Фринет – бесплатное программное обеспечение, предназначенное для обеспечения подлинной свободы общения через Интернет.
  Оно позволяет любому желающему публиковать и запрашивать информацию, сохраняя полную анонимность. Никто не контролирует 
  Фринет, даже его создатели, а это означает, что система неуязвима для манипуляций или выключения. ПО Фринет очень 
  эффективно в работе с информацией, адаптивно реплицируя контент в зависимости от спроса. Для дополнительной информации 
  прочитайте страницу <a href="/whatis.html">«Что такое Фринет?»</a>.</p>
  
  <p><b id="tor">Чем Фринет отличается от Tor? Могу ли я получить доступ к Google/Facebook и другим ресурсам через Фринет?</b><br/>
  Tor – прокси-сеть, которая позволяет получить доступ к сети анонимно, или использовать «скрытые сервисы», веб-сервера 
  которых (и другие службы) скрыты за сетью туннелей Tor. Фринет – распределенная сеть, работающая поверх Интернет. Вы 
  можете получить доступ к контенту сети Фринет только через Фринет: фрисайты (веб-сайты в сети Фринет), чаты Фринет 
  (FMS, Sone и других), загруженные в сеть Фринет файлы, почта Фринет. Фринет является распределенным хранилищем данных, 
  что означает <i>полное отсутствие центральных серверов</i> (при правильном использовании) для хранения контента.
  Это делает цензуру и атаки гораздо сложнее. Чем популярнее файл или страница, тем шире она будет кэшироваться в сети и 
  тем быстрее будет загружаться. Недостатком является то, что некоторые вещи легкие при централизованной системе (интернет, 
  скрытые сервисы Tor), сложны для сети Фринет; например, динамический контент. Такие инструменты как форумы должны быть 
  специально написаны для Фринет таким образом, чтобы сохранить конфиденциальность и не полагаться на центральные сервера. 
  Как уже было написано, они анонимны и надежны против цензуры. Мы стараемся предоставить основные инструменты с помощью 
  плагинов, смотрите Гид по Социальной Сети Фринет, чтобы узнать как настроить некоторые из вещей описанных выше.</p>
  
  <p>Другая большая разница заключается в том, что Фринет может работать в режиме даркнет (другое название режима 
  Друг-с-Другом). В таком режиме работы ваш нод-узел будет устанавливать соединения только с нод-узлами ваших друзей 
  (и может быть к нод-узлам их друзей для ускорения процесса), которых вы добавили вручную. Это делает блокирование 
  Фринет, например, на национальном брандмауэре, крайне сложным.</p>
  
  <p>Строго говоря, есть несколько центральных серверов: большинство пользователей Фринет загрузило программное 
  обеспечение Фринет с этого сайта; большинство пользователей Фринет используют Фринет в режиме опеннет, то есть 
  подключение автоматически быстрее чем при работе в режиме даркнет – Фринет использует нод-узлы добровольцев 
  (seed nodes), как сервера для организации подключений пользователей к сети. Но это не является действительно 
  необходимым.</p> 
  
  <p>Таким образом, Фринет больше беспокоится о сопротивлении цензуре, чем о конфиденциальности и анонимности; 
  приватность имеет жизненно важное значение для предотвращения цензуры, но приватность не является достаточной без 
  надежной сети, которая может сохранить популярный контент, даже если автор контента исчезает. Поэтому Фринет 
  разработан сложным для блокирования, полностью отделенным от обычной веб-сети и децентрализованным.</p>

  <p><b id="who">Кто стоит за Фринет?</b><br>
  Фринет вырос из разработки для анонимных публикаций, созданной Яном Кларком во время учебы в Университете Эдинбурга в 
  Шотландии. С тех пор многие другие люди внесли свой вклад в воплощение предложения Яна в реальность.</p>

  <p><b id="trust">Как можно доверять информации анонимных авторов?</b><br>
  Цифровая подпись информации позволяет людям доказать авторство, этот метод часто используется для проверки подлинности 
  авторства электронных писем. Более того, вы можете подписывать информацию, не представляясь, тем самым становясь 
  анонимной персоной. Вы можете доказать, что вы написали различные части информации в сети Фринет, не раскрывая вашу 
  личность. Таким образом вы можете вырастить надежную репутацию вашей анонимной персоны.</p>

  <p><b id="donate-bw">Должен ли я предоставлять дисковое пространство и трафик?</b><br>
  В действительности вы ничем не жертвуете в том смысле, что вы теряете дисковое пространство и пропускную способность; 
  на самом деле вы ничего не распространяете что-либо (по меньшей мере, не таким же способом как делают другие программы). 
  Это больше похоже на загрузку в общий пул ресурсов сети Фринет.</p>

  <p><b id="leech">У меня нет ресурсов, которыми я мог бы поделиться с сетью и я хочу загружать больше.</b><br>
  Получаете ли вы контент анонимно? Фринет изначально разработан с идеей анонимности, производительность занимает второе 
  место.</p>

  <p><b id="donate-more-bw">Все мои друзья предоставляют сети очень мало дискового пространства и пропускной способности 
  своего канала. Зачем мне предоставлять больше ресурсов?</b><br>
  Если вас устраивает текущая скорость работы ПО, то ничего не требуется менять. Но если же вы хотите большего, вам стоит 
  рассмотреть вопрос о предоставлении большего количества ресурсов и организации работы вашего узла в режиме приближенному 
  к 24/7 насколько такое возможно. И попросите ваших друзей сделать то же самое.</p>

  <p><b id="donate-lot">Если я предоставлю много ресурсов, существенно ли улучшится мои впечатления от работы Фринет?</b><br>
  Ваши впечатления от работы Фринет, безусловно, станут лучше, но для действительно большого шага вперед нам нужно, чтобы 
  больше людей начали думать так же, как вы. Пропускная способность важнее дискового пространства.</p>

  <p><b id="legal">Легальность Фринет.</b><br>
  В настоящее время нам неизвестно ни одного судебного преследования непосредственно за использование Фринет. Некоторые 
  утверждают, что закон <a href="https://en.wikipedia.org/wiki/DADVSI">DADVSI</a>
  делает Фринет нелегальным во Франции; в Германии закон о хранении данных, требующий обязательную регистрацию, 
  <a href="http://en.wikipedia.org/wiki/Telecommunications_data_retention#Germany">отменен</a>.
  Кроме того, верховный суд Германии постановил, что <a href="http://merlin.obs.coe.int/iris/2010/7/article13.en.html">необеспечение 
  безопасности вашей WiFi-сети должным образом</a> делает вас ответственным за загрузки других людей через вашу сеть; это может 
  или не может быть распространено на запрещение анонимного пирингового файлового обмена такого как Фринет. <a href="http://en.wikipedia.org/wiki/ACTA">ACTA</a> 
  может иметь далеко идущие последствия, в том числе и для Фринет, и этот закон должен пройти, как и аналогичные законы вроде 
  IPRED2 которые были опробованы в прошлом. Также были попытки заставить пиринговые системы предоставлять возможности для 
  прослушивания переговоров в США; есть <a href="http://www.bbc.co.uk/news/uk-politics-19968068">тревожные события</a> в 
  Великобритании, в результате которых Фринет может быть заблокирован, но Фринет по сути не был признан нелегальным. Насколько 
  нам известно, ни одна из попыток, кроме первых двух, не увенчались успехом. Многие из них спорны так или иначе (в зависимости от 
  того, насколько широко применяется законодательство) и будут решены прецедентным правом. Иногда закон слеп. Вы можете прочитать 
  совет EFF (ориентированный на США) пиринговым разработчикам <a href="https://www.eff.org/wp/iaal-what-peer-peer-developers-need-know-about-copyright-law">здесь</a>.
  Если вам нужна юридическая консультация, поговорите с юристом. Также прочитайте следующий раздел, особенно если вы из Китая; 
  блокирование протокола может означать, что власть не любит нас.</p>

  <p><b id="blocked">Блокируется ли Фринет национальными брандмауэрами?</b><br>
  Китайский национальный брандмауэр (Золотой Щит) блокирует наш сайт в течение многих лет, а в 2005 году вдобавок заблокировал 
  протокол версии 0.5. Это означает, что в Китае нам не рады, поэтому будьте осторожны, если вы запустите Фринет в Китае. Некоторые 
  другие страны (например, Франция) враждебно настроены к пиринговому обмену файлами, и в конечном итоге могут заставить провайдеров 
  связи блокировать пиринговые сети (но прямо сейчас Фринет прекрасно работает во Франции и у нас много французских пользователей).</p>
  
  <p>Технически Фринет 0.7 имеет минимальную защиту от блокирования; протокол достаточно сложен в идентификации (мы работаем над 
  <a href="https://wiki.freenetproject.org/Transport_plugins">«транспортным плагином»</a>, который <a href="http://en.wikipedia.org/wiki/Steganography">сделает 
  обнаружение Фринет еще более сложным</a>. Фринет поддерживает режим работы <a href="https://wiki.freenetproject.org/Darknet">даркнет 
  (darknet)</a> (подключения устанавливаются только с друзьями), который делает сбор информации о нод-узлах сети Фринет и их 
  блокирование очень трудной задачей. Отметим, что многие беспроводные интернет-провайдеры блокируют все p2p сети вместе с другим 
  контентом, и многие корпоративные или учебные сети могут блокировать Фринет (но даже если они этого не делают, <a href="#trouble">вы 
  не должны запускать ПО Фринет на работе</a> в нерабочих целях!).</p>
  
  <p>Продолжаются дискуссии в США и Великобритании о требованиях законодательства встраивать бэкдоры везде и блокировать все, что не 
  имеет встроенных бэкдоров. Это вряд ли пройдет, особенно в США, где подобные законы предлагались периодически, но признавались 
  неконституционными. Тем не менее, даже если бы правительство пришло к нам и потребовало встроить бэкдор, мы не в состоянии сделать 
  это и тайно распространить троянскую сборку, потому что Фринет – это программное обеспечение с открытым исходным кодом, многие люди 
  вносят свой вклад в этот код, поэтому; таким образом юридически мы должны предоставить вам исходный код, включающий заказанные 
  правительством бэкдоры – которые не останутся тайной надолго! Если бы такое случилось, вероятно, что некоммерческая организация 
  <a href="/donate.html">Freenet Project Incorporated</a>, управляющая этим веб-сайтом и обработкой пожертвований, прекратила свою 
  деятельность и закрылась; но сама сеть Фринет будет жить хорошо и дальше лишь с той разницей, что проект не сможет так же 
  оплачивать труд разработчиков.</p>
  
  <p>Смотрите <a href="http://en.wikipedia.org/wiki/Network_neutrality">«сетевой нейтралитет»</a> и <a href="https://www.eff.org/">EFF</a> 
  или подобные организации в вашей стране, чтобы разобраться в политике всего этого и как вы можете остановить такие законы.</p>
      
  <p><b id="trouble">Могут ли у меня быть неприятности, если я поднял нод-узел?</b><br>
  Этот вопрос связан с вопросом <a href="#legal">«Легальность Фринет»</a>. Мы делаем все что можем, чтобы сделать чрезвычайно 
  сложным для любой разумной правовой системы наказание кого-либо за запуск нод-узла; существует мало прецедентов таких действий в 
  развитых странах. Многие правовые системы признают важность свободы слова, которая является основной целью Фринет. Скажу, что
  есть риск в любой вашей деятельности, с которой может не согласиться ваше правительство; вы должны принять обдуманное решение, 
  прежде чем пойдете на такой риск. Кроме того, ваш провайдер или ваш хостинг могут иметь проблемы с Фринет. Как минимум один 
  французский хостинг заблокировал Фринет (вместе с TOR и другими) на своих серверах; пожалуйста, прочитайте ваши правила и условия, 
  чтобы убедиться, что вам позволено запускать ПО Фринет. Отметим также, что Фринет может использовать довольно много трафика, как 
  минимум 20ГБ/месяц, и это может быть проблемой на дешевом или общем подключении. И, конечно, использование ПО Фринет на работе 
  может вовлечь вас в неприятности тоже, если вы не используете его в рабочих целях.</p>

  <p><b id="copyright">Об авторском праве.</b><br>
  Есть несколько отличных мыслей на эту тему на странице <a href="/philosophy.html">«Философия»</a>. С некоторыми законами по 
  авторскому праву у Фринет могут быть проблемы. Пожалуйста, прочитайте <a href="#legal">«Легальность Фринет»</a> и 
  <a href="#blocked">«Блокируется ли Фринет национальными брандмауэрами?»</a></p>

  <p><b id="childporn">Как насчет детского порно, материалов оскорбительного содержания или терроризма?</b><br>
  В то время как большинство людей желает, чтобы детской порнографии и терроризма не существовало, человечество не должно лишать 
  себя свободы общения только лишь из-за того, как очень небольшое количество людей сможет использовать такую свободу.</p>

  <p><b id="offensive">Я не хочу, чтобы мой нод-узел использовался для «скрытого» хранения детского порно, материалов 
  оскорбительного содержания или чего-нибудь связанного с терроризмом. Что я могу сделать?</b><br>
  Настоящая проверка утверждающих, что они верят в свободу слова – то, насколько они терпимы к речам, с которыми не согласны или 
  даже находят отвратительными. Если такое для вас не приемлемо, вам не стоит поднимать нод-узел Фринет. Кроме того, контент в сети 
  Фринет доступен лишь до тех пор пока популярен; он исчезнет, когда пользователи потеряют интерес к нему. Тем не менее, контент 
  должен храниться в течение некоторого времени, и если достаточное количество людей будет им интересоваться, он будет храниться 
  вечно.</p>

  <p><b id="export">Что насчет экспортных ограничений шифрования?</b><br>
  Проект Фринет уведомил власти США (с размещения файлов на ресурсе SourceForge, который расположен на территории США), что в 
  рамках проекта будет экспорт шифрования. Пока ваша страна не запрещает использовать шифрование, у вас все отлично. Кроме того, в 
  настоящее время в экспортных законах существует исключение для программного обеспечения, которое делает именно то, что делает 
  Фринет. Тем не менее, Sun ограничивает силу шифрования доступного в виртуальной машине Java, на которой работает Фринет; вы 
  должны установить Unlimited Strength Policy Files для Java для повышения производительности, если такое возможно. Однако, Фринет 
  будет работать и без этого, используя встроенные функции шифрования.</p>

  <p><b id="whatelse">Мне нечего скрывать и я не нуждаюсь в анонимности. Есть что-нибудь еще, что Фринет может мне предложить?</b><br>
  Даже без своего основного достоинства - анонимности, Фринет очень полезен из-за своего уникального способа распределения контента 
  и информационной нагрузки. Проще говоря это означает, что вы можете опубликовать веб-сайт, не беспокоясь о том каким большим 
  будет сайт и что кто-то разместит рекламные баннеры на нем. Хотя маловероятно, что фрисайты будут загружаться быстрее обычных 
  веб-сайтов, они (фрисайты) лучше приспособлены к внезапному всплеску посетительской активности (что часто случается, когда 
  относительно неизвестный сайт получает ссылку с большого портала), и разумная скорость загрузки больших файлов возможна тоже. 
  Только не ожидайте очень низкую латентность сети.</p>
      
  <h2> Технические ответы</h2>

  <p><b id="how">Как я могу использовать программное обеспечение? Я загрузил его и запустил, но не вижу графического интерфейса.</b><br>
  Фред (Fred от Freenet Reference Daemon) работает как демон или служба в фоновом режиме. Обычно вы взаимодействуете с ним через 
  клиент Фринет. Встроенный клиент fproxy позволяет вам общаться в сети Фринет с помощью веб-браузера. При установке ПО Фринет 
  создается ярлык запуска «Browse Freenet» на рабочем столе и/или в меню «Пуск». Другой способ – иконка в трее (кролик), пункт 
  меню «Open Freenet». Если предложенное выше не работает, попробуйте открыть в браузере страницу шлюза <a href="http://127.0.0.1:8888/" rel="nofollow">http://127.0.0.1:8888/</a>. 
  Пройдитесь по предложенным ссылкам, чтобы добраться до нескольких популярных сайтов-каталогов Фринет.</p>  
  
  <p>Если вы ищете приложения, которые работают поверх Фринет и предоставляют разные интерфейсы или функциональные возможности, пожалуйста, посмотрите страницу <a href="/tools.html">«Инструменты»</a>.</p>
      
  <p><b id="slow">Почему Фринет такой медленный?</b><br>
  Когда вы только установили ПО Фринет, оно будет работать медленно и вы можете увидеть ошибки «данные не найдены» или «не 
  найден маршрут» при открытии фрисайтов. Это нормально, Фринет значительно ускорится с течением времени. Для лучшей 
  производительности вы должны стремиться, чтобы ваш клиент Фринет работал 24 часа в сутки. Именно поэтому мы устанавливаем 
  Фринет службой.</p>
  
  <p>Пожалуйста, имейте ввиду, что Фринет по своей природе сеть с высокой латентностью: может потребоваться некоторые время 
  для загрузки страницы в первый раз, но все же это разумная скорость загрузки (по меркам анонимных систем!). Вы увеличите 
  производительность при просмотре фрисайтов, если будете использовать отдельный браузер и <a href="#connections">увеличите 
  его ограничения подключений</a>. Также Вам стоит установить размер хранилища данных и ограничение пропускной способности 
  такими высокими, насколько возможно. Защита вашей анонимности стоит некоторое количество производительности. Вы можете 
  определить сколько, меняя уровни безопасности на странице «Настройки» – «Уровни защиты».</p>

  <p><b id="search">Работает ли поиск в сети Фринет?</b><br>
  Да, существует несколько различных механизмов поиска. Для поиска по фрисайтам (веб-сайтам в сети Фринет) вы можете 
  воспользоваться формой поиска на домашней странице или выберите в меню пункт «Обзор» -- «Поиск во Фринет». Если его там нет, 
  пройдите на страницу «Настройки» - «Дополнения» и загрузите библиотеку плагина. Кроме того, Frost и Thaw обеспечивают поиск 
  сообщений и файлов. Обратите внимание, что поиск в сети Фринет намного сложнее, чем в других сетях; в связи с особенностями 
  архитектуры сети Фринет и поставленными перед ней задачами.</p>

  <p><b id="firewall">Как настроить Фринет для работы за брандмауэром/NAT?</b><br>
  В целом, Фринет должен работать с NAT. Тем не менее, вам стоит вручную перенаправить порты, если такое возможно. Откройте 
  страницу <a href="http://127.0.0.1:8888/friends/" rel="nofollow">«Друзья»</a> или страницу <a href="http://127.0.0.1:8888/strangers/">«Чужие»</a>.
  Внизу вы увидите список портов, используемых нод-узлом. Вы должны перенаправить (для UDP) даркнет FNP и опеннет FNP порты. 
  Возможно, вам придется изучить документацию к маршрутизатору, чтобы выяснить как это сделать. Фринет должен перенаправлять 
  их себе с помощью <a href="https://en.wikipedia.org/wiki/Universal_Plug_and_Play">UPnP (Universal Plug and Play)</a>, но 
  такое не всегда работает (и такое точно никогда не сработает, если у вас не установлен UPnP плагин; или если за вашим 
  маршрутизатором есть другой маршрутизатор).</p>
  
  <p>Если у вас есть адрес DynDNS или другое доменное имя, указывающие на компьютер, с которого вы запускаете нод-узел Фринет, 
  сообщите нод-узлу об этом. Перейдите на страницу <a href="http://127.0.0.1:8888/config/node?mode=2">«Настройки» -- «Основные настройки»</a> 
  (в расширенном режиме) и найдите пункт «Задать IP-адрес вручную». Введите ваше доменное имя в это поле и примените настройку.</p>

  <p><b id="connection-perm">Требуется ли постоянное подключение к сети для запуска нод узла?</b><br>
  Нет, но такой вариант предпочтителен. Вы можете запустить ПО Фринет и протестировать его работу через «временные» 
  подключения (например, телефонный дозвон или мобильный модем), но для сети в целом для большей ее полезности, мы нуждаемся 
  в как можно большем количестве постоянно работающих нод-узлов (большая часть подключений посредством кабельных и DSL 
  модемов достаточно «постоянна» для этого). Более поздняя версия Фринета сможет лучше использовать нод-узлы с непостоянным 
  доступом к сети.</p>

  <p><b id="connections">Почему клиент Фринет загружает только 1 или 2 файла одновременно?</b><br>
  Многие браузеры ограничивают число одновременных подключений к чему-то слишком низким значением для эффективного серфинга в 
  сети Фринет (страницы в сети Фринет при загрузке часто имеют гораздо более высокие задержку, чем обычные веб-страницы). 
  Обычно эту настройку можно изменить. Например, в Mozilla Firefox введите <span style="font-weight: bold;">about:config</span> 
  в адресной строке браузера и измените значения следующих настроек на приведенные ниже. Используйте фильтр <span style="font-weight: bold;">&quot;connections&quot;</span>, 
  чтобы отобрать только нужные настройки:</p>

  <code>
  network.http.max-connections 200<br>
  network.http.max-connections-per-server 200<br>
  network.http.max-persistent-connections-per-proxy 200<br>
  network.http.max-persistent-connections-per-server 200<br>
  </code>
  
  <p>Заметьте, что при таком изменении настроек Mozilla будет использовать большее количество подключений для всего, что вы 
  смотрите; и это может оказаться нежелательным с точки зрения перегрузки сети. Но в идеале вы должны использовать отдельный 
  браузер для Фринет для лучшей безопасности.</p>

  <p><b id="store-perm">Почему Фринет не может хранить данные постоянно?</b><br>
  Потому что мы не можем найти способ реализации без ущерба другим целям и задачам Фринет. Например, люди часто предлагают, 
  чтобы нод узел никогда не удалял данные, которые они хотят кэшировать постоянно. Однако, это не будет работать, даже если 
  данные все еще будут доступны на их нод-узле, нет никакого способа обеспечить маршрутизацию запросов данных до этого 
  нод-узла. Мы рассмотрели много разных способов как Фринет сможет хранить данные перманентно, но ни один из них не 
  работает, либо является компромиссным решением в ущерб основным целям – анонимности и масштабируемости.</p>
  
  <p>Контент, который пользуется популярностью, будет сохраняться всегда. Например, большинство фрисайтов на которые есть 
  ссылки в основных индексах все еще доступны спустя годы (по меньшей мере их главные страницы). Если контент не очень 
  популярен, то лучший способ сохранять его доступность – регулярно перезагружать его в сеть. Интересным решением является 
  плагин «Keepalive», который сделает это за вас, даже если вы не загружали файл/фрисайт. Планируется улучшение – особый вид 
  запроса, который позволит проверять доступность файла из случайной точки сети.</p>

  <p><b id="why-java">Почему Фринет реализуется на Java?</b><br>
  Существуют различные мнения по выбору Java для реализации Фринет (даже среди основных разработчиков). <a href="/people.html">Ян Кларк</a> 
  и несколько других разработчиков сторонники Java и сделали выбор в пользу Java. Даже если все сойдутся во мнении 
  переключиться на другой язык, повторная реализация текущего протокола Фринет будет довольно большой задачей и займет 
  значительное количество времени, потому что нам доступно ограниченное количество времени разработчиков. Флейм в листе 
  разработки на тему выбора другого языка не приветствуется. Кто хочет реализовать Фринет на другом языке, можете 
  попытаться. Однако, не стоит недооценивать объем работы.</p>
      
  <p><b id="fproxy-lan">Как разрешить подключения к FProxy с других компьютеров?</b><br>
  Если вы хотите, чтобы все могли использовать ваш нод-узел, у вас есть следующие варианты:<br></p>
  
  <ul>
  <li>Откройте страницу <a href="http://127.0.0.1:8888/config/fproxy">«Настройки» -- «Веб-интерфейс»</a> и включите расширенный режим.</li>
  <li>Остановите работу вашего нод-узла и отредактируйте файл freenet.ini вручную.</li>
  </ul>
  
  <p>В обоих случаях измените следующие параметры:</p>
  
  <code>
  fproxy.bindTo=0.0.0.0<br>
  fproxy.allowedHosts=*<br>
  </code>
  
  <p>Конечно, это оставляет ваш нод-узел широко открытым в отсутствие брандмауэра. Если вы предпочитаете использовать контроль доступа 
  к Фринет, то вы можете использовать такие строки:</p>
  
  <code>
  fproxy.bindTo=0.0.0.0<br>
  fproxy.allowedHosts=127.0.0.1,192.168.1.0/24<br>
  </code>
  
  <p>Или даже (найдите ваш IP-адрес в ipconfig/ifconfig/winipcfg и замените его на 192.168.1.1):</p>
  
  <code>
  fproxy.bindTo=127.0.0.1,192.168.1.1<br>
  fproxy.allowedHosts=127.0.0.1,192.168.1.0/24<br>
  </code>
  
  <p>И если вы хотите предоставить полный доступ (то есть изменение настройки конфигурации, перезапуск и т.д.) к нод-узлу (ВНИМАНИЕ: 
  Будьте очень осторожны предоставляя кому-нибудь полный доступ к FProxy!):</p>
  
  <code>
  fproxy.allowedHostsFullAccess=127.0.0.1,192.168.1.0/24<br>
  </code>

  <p><b id="openjdk">Проблемы с OpenJDK при установке</b><br>
  <p>Некоторые версии OpenJDK, а особенно которая включена в Ubuntu 8.04, имеют некоторые проблемы с SSL; из-за них происходит 
  ошибка при установке. Пожалуйста, установите Sun JRE, как минимум 6-й версии. В Ubuntu или Debian, откройте терминал с правами 
  пользователя root и выполните:</p>
  
  <pre>
  apt-get install sun-java6-bin
  update-java-alternatives -s java-6-sun
  </pre>

  <p><b id="whatsnew">Что нового? Есть ли лог изменений?</b><br>
  Для каждой новой сборки, краткое описание всех основных изменений размещается в листах поддержки и разработки, а также на 
  доске eng.freenet в Freetalk. Обычно эта информация передается в FMS и Frost тоже. Кроме того, для более детального просмотра, 
  проверьте <a href="https://github.com/freenet/">git-репозиторий</a>. Также вы можете проверить блоги разработчиков (в 
  закладках по умолчанию, или в сети; например, <a href="http://amphibian.dyndns.org/flogmirror/">toad</a>). Предупреждаем, эти 
  блоги чаще всего обновляются нерегулярно и часто сбиваются на напыщенные речи на посторонние темы.</p>
    
  <p><b id="backtrace">Почему так много сообщений в моем лог-файле с приложением трассировки?</b><br>
  Fred (и Фринет в целом) все еще в активной разработке, и если что-то пойдет не так, стоит точно знать, что пошло не так.</p>
      
  <p><b id="stabchange">Как я могу переключаться между основной и тестовой сетями?</b><br>
  Тестовая сеть – самостоятельная сеть, которая позволяет разработчикам точно знать, что происходит. В тестовой сети нет 
  анонимности. Существует отдельный дистрибутив (для <a href="https://downloads.freenetproject.org/latest/testnet_installer_offline.jar">Linux, OS/X</a> 
  и <a href="https://downloads.freenetproject.org/latest/TestnetInstaller.exe">Windows</a>). Установленный клиент тестовой сети 
  может часто ломаться и вылетать, поэтому вам следует иметь некоторое представление, что вы делаете… или по крайней мере быть 
  готовым к регулярной переустановке клиента.</p>
      
  <p><b id="freenetinigone">Фринет не запускается, лаунчер говорит, что не удается найти freenet.ini</b><br>
  Это связано с неудачной ошибкой, исправленной в билде 1249. Вы можете исправить это, переименовав файл freenet.ini.tmp в 
  freenet.ini.</p>
      
  <p><b id="servicenotrespond">Фринет не запускается, говорит «служба не ответила на сигнал»</b><br>
  Это должно быть исправлено сейчас; дайте нам знать, если вы видите эту ошибку. Если у вас очень старая установка, вам может 
  быть интересно ознакомиться с <a href="https://wiki.freenetproject.org/Installing/Windows#Service_did_not_respond_to_signal">дополнительной 
  информацией</a>.</p>
      
  <p><b id="kaspersky">У меня установлен антивирус Касперского и Фринет не устанавливается или неизменное показывает «База данных очереди загрузок/выгрузок повреждена!».</b><br>
  У антивируса Касперского могут быть сложности с Фринет. Смотрите <a href="https://wiki.freenetproject.org/Installing/Windows#.27Download.2Fupload_queue_database_corrupted.21.27_.28When_using_Kaspersky_on_Windows_7.29">здесь</a>. 
  Мы рекомендуем вам отключать антивирус Касперского во время установки и во время запуска нод-узла, а также исключить из 
  области проверки директорию, куда вы установили клиентское ПО Фринет (скорее всего C:\Program Files\Freenet или 
  C:\Program Files (x86)\Freenet).</p>

  <p><b id="forgotpass">Я установил пароль и забыл его. Что я могу сделать?</b><br>
  Пароль защищает ваши загрузки/выгрузки, а также клиентский кэш (кэш всего, что вы недавно просматривали в сети Фринет). Он 
  хранится в файле master.keys. Нет никакого способа восстановить пароль, но если вы его все же забудете, вы можете уничтожить 
  ваши загрузки/выгрузки и клиентский кэш с помощью безопасного удаления файла master.keys. Смотрите <a href="#privatedata">вопрос 
  о личных данных и локальной безопасности</a> для дополнительной информации.</p>
  
  <p><b id="clockskew">Фринет постоянно жалуется на искаженное время</b><br>
  ПО Фринет будет испытывать проблемы, если вы будете постоянно перематывать ваше системное время. Обычно такое происходит, 
  когда что-то регулярно сбрасывает ваше время на большие значения. В Linux вам стоит запустить ntpd чтобы быть уверенным, что 
  ваши часы не слишком далеко (не жизненно необходимо, но полезно); если вы видите ошибку про искаженное время, попробуйте 
  добавить опцию «-x», чтобы избежать больших прыжков во времени назад. Кроме того, запуск ntpdate при загрузке системы 
  позволит сделать один большой скачок до запуска ПО Фринет. Это хорошая идея. Иногда такое может случиться и в Windows; 
  расскажите нам, как вам удалось это исправить… хотя в целом все не настолько серьезно, особенно если большой прыжок во 
  времени случается лишь раз в день.</p>

  <h2> Ответы на вопросы связанные с публикацией</h2>
  
  <p><b id="find">Если я опубликую что-нибудь в сети Фринет, как мою публикацию найдут другие пользователи сети? Не должны ли они знать ключ, который я использовал?</b><br>
  Да, люди должны знать ключ, который вы использовали для публикации вашей информации. Это означает, что вам придется объявить 
  о своем ключе.</p>
  
  <p>Наиболее распространенный способ сделать это – отправить сообщение, содержащее ваш ключ и краткое описание публикации, 
  автору одного из фрисайтов. Большинство порталов доступных в сети Фринет читают Freetalk и FMS форумы, там есть специальные 
  разделы для анонсов. Также вы можете отправить ваш ключ другим пользователям с помощью <a href="/lists.html">листа рассылки</a>, 
  на канале IRC (irc.freenode.net #freenet), личной почтой, или рекламируя свой фрисайт на обычном www-сайте. Если вы более 
  экстравагантны, даже можете попробовать скайрайтинг (skywriting). Граффити не рекомендуется из соображений легальности.</p>

  <p><b id="chk">Как я могу опубликовать хэш-ключ контента (CHK)?</b><br>
  Хэш-ключ для доступа к контенту формируется на основании содержания публикуемого контента; таким образом, ключ станет 
  известен только после загрузки контента в сеть. Чтобы вставить в сеть ключ, просто укажите его как «CHK@»; Фринет скажет 
  вам, что для актуального ключа вставка выполнена.</p>
  
  <p><b id="update">Возможно ли обновлять или удалять документы в сети Фринет?</b><br>
  В настоящее время документ, размещаемый в сеть Фринет, при совпадении имени с уже существующим документом в сети на самом 
  деле служит для распространения существующего документа. Также сейчас нет никаких средств удаления документа из Фринет. 
  Документы, которые никогда не запрашиваются, в конце концов удаляются из употребления.</p>
  
  <p>Тем не менее, вы можете использовать ключ <a href="https://wiki.freenetproject.org/USK">ключ USK (Updatable Subspace Key)</a> 
  для обеспечения обновления фрисайта: ваш нод-узел будет автоматически искать более поздние редакции сайта (после того, как 
  вы посетите сайт; или всегда, если вы сделаете для сайта закладку), и показывать вам последние версии. Вы можете принудить 
  нод-узел искать последнюю версию, изменив число в конце ключа на отрицательное.</p>

  <h2> Вопросы участия</h2>
  
  <p><b id="idea">У меня есть отличная идея…</b><br>
  Хорошо! Первый шаг: почитайте <a href="/lists.html">архивы листа рассылки</a>. Есть неплохие шансы, что кто-то еще уже 
  предлагал эту идею и обсуждал ее с группой. Либо в идее был найден дефект, или, возможно, было принято решение отложить 
  реализацию идеи на потом. Некоторые примеры идей, которые уже обсуждались – хранение информации по хэш-ключу, 
  перенаправление ключей, подписание ключей/данных, использование UDP, обнаружение серверов, URL-ссылки, управление версиями 
  документов и другие. Если вы не нашли обсуждение вашей идеи в архивах, оформите вашу идею в соответствующем 
  <a href="/lists.html">листе рассылки</a>.</p>

  <p><b id="contribute">Могу ли я принять участие в проекте Фринет?</b><br>
  Совершенно верно. Даже если у вас нет времени и вы не обладаете навыками, чтобы стать одним из разработчиков проекта, вы 
  можете помочь другими способами:</p>

  <ul><li> Помогите в тестировании ПО Фринет, установив и настроив серверную часть ПО на вашем компьютере.
  </li><li> Установите клиентское ПО на ваш компьютер для проверки получения информации и публикации собственного контента.
  </li><li> Работайте над веб-сайтом проекта Фринет (включая FAQ).
  </li><li> Предлагайте свои идеи в листах обсуждений.
  </li><li> <a href="https://wiki.freenetproject.org/Translation">Переводите пользовательский интерфейс</a> на ваш родной язык (веб-сайт и установщики также нуждаются в переводе, вы можете спросить нас об этом).
  </li></ul>
  
  <p>Если вы разработчик, вы можете помочь в непосредственной работе над ПО Фринет; или придумывая и создавая дополнительные 
  приложения, работающие в сети Фринет. Внешние приложения (например, FMS – основная система форумов сети Фринет) используют 
  клиентский протокол Фринет (<a href="https://wiki.freenetproject.org/FCPv2">Freenet Client Protocol, FCP</a>) для общения 
  с сетью Фринет. Другая возможность – написание плагинов, они пишутся на Java и исполняются в JVM ПО Фринет; и могут быть 
  добавлены в дистрибутив, когда они будут готовы. Пример популярного плагина – Sone, микро-блог/социальная сеть внутри 
  Фринет. Вы можете посмотреть инструкции по установке FMS и Sone, например, в Гиде по Социальным Сетям Фринет.</p>
  
  <p>Если вы хотите работать над самим ПО Фринет, смотрите <a href="https://freenetproject.org/developer.html">здесь</a>, 
  как получить исходный код.</p>
  
  <p>Приветствуется размещение ссылок на нас, например, как сделал этот <a href="http://www.webhostingsearch.com/">гид по 
  веб-хостингу</a>. Также приветствуются улучшения вебсайта, исправление орфографических и грамматических ошибок, новые идеи 
  (смотрите <a href="#idea">предыдущий ответ</a>). Вам может оказаться полезной <a href="https://wiki.freenetproject.org/Main_Page">wiki</a> 
  проекта Фринет.</p>
  
  <p>Если вы хотите принять участия в Фринет любым способом, свяжитесь с нами через <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/">почтовый 
  лист разработчиков</a>, на <a href="/irc.html">канале в IRC-чате</a>, анонимно в форуме freenet на FMS, или напишите 
  электронное письмо <a href="mailto:ian@locut.us">Яну</a>.</p>
  
  <p>Последний, но не менее важный способ участия – <a href="/donate.html">пожертвования</a> для поддержки наших 
  оплачиваемых разработчиков и покрытия расходов на содержание сервера.</p>
      
  <p><b id="access">Как я могу получить доступ к коду и сайту?</b><br>
  Смотрите детали о нашем git-репозитарии и другую информацию на <a href="/developer.html">странице разработчика</a>.</p>
  
  <p><b id="devtools">Какие инструменты мне потребуются для помощи в разработке?</b><br>
  Для сборки и развертывания сервера Фринет, вам потребуются инструменты Java, совместимые с Sun’s JDK версии 1.6 или выше. 
  Вы можете загрузить исходные архивы на странице загрузок для конкретного билда, или используйте git, чтобы получить самую 
  свежую версию исходника, детали смотрите <a href="/developer.html">здесь</a>. Дальнейшие инструкции по сборке и 
  развертыванию сервера включены в код. Хорошая идея – подключайтесь к нашему IRC-каналу <a href="irc://irc.freenode.net/freenet">#freenet</a> 
  на сервере irc.freenode.net.</p>

  <p><b id="freenethelp">Есть ли сайт-помощник с более глубокой информацией по вопросам новичков о Фринет, и как люди могут поучаствовать в проекте?</b><br>
  Взгляните на <a href="https://wiki.freenetproject.org/">нашу wiki</a>. В настоящее время <a href="https://old-wiki.freenetproject.org">старая 
  wiki</a> доступна только для чтения, но в ней достаточно информации и иногда она полезна. Есть несколько 
  реализаций wiki в сети Фринет. Самая популярная реализация называется Jfniki. Ссылка на нее есть в закладках на странице 
  «Обзор Фринет» после установки ПО Фринет.</p>
      
  <p><b id="bugs">Где я могу сообщать об ошибках?</b><br>
  Вы можете использовать нашу <a href="https://bugs.freenetproject.org/">систему контроля ошибок</a> или отправить письмо в 
  наш <a href="/lists.html">почтовый лист поддержки</a>.</p>
  
  <p><b id="theory">Я компьютерный ученый/математик, как я могу помочь? Исследование сложных задач.</b><br>
  Смотрите <a href="https://wiki.freenetproject.org/Research_challenges">здесь</a>.</p>

  <h2> Ответы по безопасности</h2>
      
  <p><b id="browser">Могу ли я обозревать Фринет моим обычным браузером?</b><br>
  Фринет имеет веб-интерфейс: большая часть контента в сети Фринет – фрисайты и загрузки; настройками и подключениями с 
  друзьями можно управлять через веб-интерфейс. Однако, из-за слабостей современных браузеров, мы <b>настоятельно</b> 
  рекомендуем вам использовать отдельный браузер для Фринет. В частности, воровство истории браузера в любом виде является 
  серьезной угрозой; если вы будете использовать один и тот же браузер для сетей Фринет и WWW, вредоносные www-страницы 
  смогут определить, какие фрисайты вы посещали, и сообщить эту информацию своим владельцам.</p>
  
  <p>В последних версиях браузеров, обычно достаточно использовать безопасный/инкогнито режим, а приложение с кроликом в 
  системном трее в Windows попытается запустить браузер в этом режиме. Тем не менее, по нашему опыту это не на 100% 
  надежно, так что будьте осторожны.</p>
    
  <p><b id="attack">Не нарушит ли атака Х анонимность Фринет?</b></p>
  
  <p><b>Короткий ответ:</b> Наверное, для опеннет. Может быть, для даркнет.</p>
  
  <p><b>Длинный ответ:</b></p>
  
  <p>Фринет имеет различные модели угроз для Tor и Mixmaster отправителей. Фринет разработан устойчивым к цензуре: поэтому 
  должна сеть должна быть надежна, а контент должен распределяться без участия центрального севера для анонимности. 
  Анонимность важна для запрашивающих информацию, а еще больше для тех, кто выкладывает информацию в сеть. Типичным 
  примером являются корпоративные или государственные осведомители. Вообще, чтобы найти создателя какого-то контента, 
  злоумышленник должен быть способен предсказывать данные заранее, должен быть способен двигаться по сети довольно быстро, 
  и должен быть способен выполнить атаку в момент, когда контент еще только размещается в сеть; после этого контент 
  распределяется по сети и становится значительно сложнее выследить автора, который уже мог покинуть сеть. Однако, если по 
  воле случая или в случае действия непреодолимых сил злоумышленник подключился к осведомителю (или, как вариант, захватил 
  все компьютеры в сети), он может идентифицировать автора намного быстрее. Все это значительно сложнее выполнить для 
  сети, работающей в режиме даркнет, где каждый узел сети устанавливает подключения лишь с дружественными узлами, где 
  злоумышленнику очень сложно обнаруживать нод-узлы, и где для подключения к обнаруженному узлу злоумышленник должен 
  применить свои навыки социальной инженерии к оператору этого узла, чтобы стать его другом в сети. Фринет поддерживает 
  открытую сеть опеннет, но работа в режиме даркнет гораздо безопаснее и сложнее для блокирования национальными 
  брандмауэрами.</p>
  
  <p>С другой стороны Tor предназначен для обеспечения анонимности потоков данных в реальном времени, исходя из 
  предположения, что список узлов сети может быть публичным, что существует свободный мир, где узлы могут работать 
  безопасно; что авторы спорного контента могут либо скрыто держать веб-сервера сами, либо загрузить такой контент в другую 
  (скрытую, но обычно централизованную) систему хранения данных, и так далее. Tor имеет понятие «клиент» –пользователь 
  сервиса, который не предоставляет сети никаких ценностей; во Фринет каждый нод-узел транслирует данные для своих соседей. 
  Следовательно, атаки на Фринет полностью отличаются от атак на Tor. Обе системы в некоторой степени идут на компромиссы 
  для обеспечения производительности более-менее приближающейся к работе в реальном времени.</p>

  <p>Если вы можете использовать режим даркнет, доверяйте вашим друзьям, не вставляйте файлы повторно, всегда используйте 
  опцию «Вставить случайный, безопасный ключ», меняйте вашу анонимную идентичность после некоторого количество вставок. Это 
  должно обеспечить вам относительно безопасное использование Фринет. Однако, это все еще не доказано. Если вам требуется 
  подключиться, создать определенное доверие к вашей анонимной персоне, опубликовать ваш спорный контент и затем исчезнуть, 
  то вам подходит Фринет, особенно если ваш контент – это веб-сайт (но если вы подключаетесь в режиме опеннет, 
  остерегайтесь соседей). Для всего остального Tor лучше.</p>
    
  <p>Мы продолжаем работать над безопасностью Фринет, и существуют значительные усовершенствования, которые еще не были 
  реализованы; большая часть из них будет введена в ПО Фринет до версии 1.0. Криптографические туннели похожие на 
  луковичную маршрутизацию Tor – одна из возможностей, которая позволит значительно снизить влияние нижеперечисленных атак. 
  Также в планах несколько других усовершенствований, направленных на обеспечение анонимности пользователей, большей 
  надежности сети и устойчивости протокола к обнаружению.</p>
  
  <b>Основные известные атаки:</b><br>
  В интересах потенциальных пользователей мы предоставляем столько информации, сколько возможно. Также мы предполагаем, что 
  любой серьезный злоумышленник в любом случае делает свою домашнюю работу. Вот основные классы атак на Фринет, о которых 
  мы знаем к настоящему времени:</p>

  <ul><li><b>Сбор</b>: просто запустив несколько мощных нод-узлов Фринет, злоумышленник может относительно легко определить 
  большую часть нод-узлов опеннет (сеть Чужих). Эти обнаруженные нод-узлы могут быть атакованы по одному (при наличии 
  ресурсов), их трафик проанализирован или просто заблокирован национальным брандмауэром. Подключения только с Друзьями 
  (даркнет) в значительной степени решает эту проблему. Интернет-провайдеры в состоянии идентифицировать нод-узлы Фринет, 
  приложив для этого некоторые усилия, хотя мы делаем это достаточно сложным: текущий протокол Фринет разработан сложным 
  для обнаружения, в некоторый момент будет введена стеганография. Тем не менее, анализ транспортных потоков, или грубое 
  блокирование всего p2p-траффика (например, трафик между IP-адресами помечается как «потребительский» чаще, чем как 
  «деловой»), оба этих метода бьют и многих других, кроме Фринет; и, скорее всего, они будут эффективны еще в течение 
  достаточного долгого времени.</li>

  <li><b>Атаки при начальной загрузке</b>: если нод-узел устанавливает подключения не только с друзьями, он подключается к 
  опеннет нод-узлам сидерам (“seednodes”), чтобы заявить о себе и получить начальные пиры для подключения к ним. На данный 
  момент существует относительно мало нод-узлов сидеров, их список ведется вручную. Нод-узлы сидеры легко могут быть 
  заблокированы национальным брандмауэром и так далее. Есть небольшая защита по предотвращению возможных попыток 
  злоумышленников настроить свои собственные нод-узлы сидеры и встроить их в сеть, и затем «захватывать» новых 
  пользователей Фринет, которые подключаются к их нод-узлам сидерам, с целью наблюдать их трафик и так далее. Фринет 
  попытается объявлять несколько нод-узлов сидеров, но смотрите ниже пункт про корреляционные атаки, которые в основном 
  осуществимы только для единственного подключения к цели. Поэтому это вопрос ресурсов – если злоумышленник имеет ресурсы 
  для внимательного наблюдения за всеми новыми нод-узлами, у него есть хорошие шансы вытянуть нужный. В будущем мы можем 
  увеличить количество нод-узлов сидеров и будем раскрывать лишь малую их часть каждому подключающемуся нод-узлу, как 
  делает Tor с его скрытыми мостами, но это не помешает злоумышленникам создавать множество злонамеренных нод-узлов 
  сидеров и получать их в официальных списках; и, скорее всего, все еще возможно заблокировать все нод-узлы сидеры, 
  приложив некоторые усилия (что-то подобное уже случилось со скрытыми мостами Tor в Китае). Комбинация атак «сбор» и 
  «адаптивный поиск», эта атака объясняет почему сеть опеннет оценивается многими основными разработчиками как безнадежно 
  небезопасная. Если вы хотите хорошую безопасность, вам требуется подключаться только к друзьям. «Бейте и бегите» вставки 
  контента возможны и они относительно безопасны с точки зрения многих других атак, но вы принимаете риск, что нод-узел 
  сидер к которому вы подключаетесь может быть вредоносным.</li>

  <li><b>Атаки хранилища данных</b>: это в значительной степени решено в билде 1224, мы не кэшируем наши локальные запросы 
  и вставки, а также узлов подключенных к нам глубиной менее чем в 2 перехода (3 для вставок). Однако если ПО вашего 
  нод-узла имеет меньшую версию, захват хранилища данных может дать плохому парню некоторую интересную информацию. Также 
  обратите внимание, что клиентский кэш кэширует локальные запросы (но не вставки), поэтому он должен быть зашифрован и 
  защищен паролем. Это можно сделать, настроив уровень физической безопасности на ВЫСОКИЙ или ОТСУТСТВУЕТ. Вы должны также 
  зашифровать файл подкачки в частности и всю систему по возможности, чтобы предотвратить утечку информации через 
  веб-браузер, медиа-плееры и так далее. Заметим, что некоторые компрометирующие данные (например, список закладок) до сих 
  пор хранятся в незашифрованном виде; мы работаем над этим, но разве я еще не упоминал, что вам следует 
  <a href="http://www.truecrypt.org">зашифровать всю вашу систему</a>?</li>

  <li><b>Корреляционные атаки</b>: если вы подключены к нод-узлу и можете распознать запрошенные ключи (вероятно потому 
  что они были опубликованы), вы можете показать статистически, что узел, о котором идет речь, вероятно запрашивал их, 
  основываясь на доле ключей запрошенных с этого узла, расположение соседних узлов, HTL на запросы и так далее. Это будет 
  в значительной степени устранено туннелями (это довольно дорого обойдется для производительности, поэтому может 
  потребоваться отключить эту опцию по умолчанию, за исключением предсказуемых блоков), но в любом случае такая атака 
  требует более мощного злоумышленника в сравнении со следующей группой атак… Отметим также, что если вы подключаетесь 
  только к своим друзьям, то удаленный злоумышленник для атаки должен будет сначала скооперироваться с кем-то из ваших 
  друзей или социально взаимодействовать с вами, чтобы вы добавили его в друзья и предоставили возможность прямого 
  подключения; в любом случае, подключение ко всей сети таким способом достаточно дорого: если они уже подозревают лично 
  вас, вероятно, они скорее взломают вашу клавиатуру, чем будут пытаться подключиться к вашему нод-узлу Фринет!</li>

  <li><b>Адаптивный поиск</b>: если вы хотите найти автора некоторого контента, и вы способны предсказывать точные ключи, 
  которые будут вставлены, а также способны подключаться к новым нод-узлам по желанию, вы можете прослушивать трафик на 
  предмет ключей; угадывая откуда пришли ключи, вы подключаетесь к нод-узлам ближе к источнику, и если ваша догадка верна, 
  получите больше ключей, что даст вам больше точную информацию об авторе. Далее атака становится все быстрее и быстрее и 
  в конечном итоге определяет автора. Эта атака является самой мощной при вставке больших предсказуемых файлов, но опция 
  «Вставить случайный, безопасный ключ» сделает ключи непредсказуемыми даже для предсказуемого контента с помощью 
  случайных зашифрованных ключей. Недостаток этого способа заключается в том, что программное обеспечение создает 
  различные ключи каждый раз для того же самого файла, и вы никогда не сможете безопасно вставить повторно тот же самый 
  файл под тем же самым ключом. Учитывая, что сохранность данных в настоящее время относительно низкая, это проблема. В 
  любом случае, если вы <i>можете</i> использовать опцию случайного ключа, злоумышленник не способен продвигаться к вам, 
  пока вы не объявите о файле: большая часть совпадений с ключом будет поступать не от актуальной вставки контента, а в 
  сообщениях пользователей. Но есть и гораздо меньшая часть, с ней поможет периодическое изменение псевдонима идентичности 
  при условии, что злоумышленник не сможет легко связать новую и старую идентичности. Использование отдельной 
  идентичности, которая не общается слишком много, для публикации деликатного контента – это тоже поможет. Другая вещь, 
  которая имеет огромное значение – подключение только к своим друзьям (то есть использование режима даркнет): это делает 
  получение новых подключений к нод-узлам ближе к той части сети, где вы должны быть по его мнению, экстремально сложным 
  для злоумышленника; даркнет помогает, как и для корреляционных атак. Поэтому основные проблемы с этой атакой: 1) Файлы, 
  которые не очень популярны исчезают из сети Фринет довольно быстро, поэтому нуждаются в повторной вставке, но 
  небезопасно использовать один и тот же ключ для повторной вставки (вот для чего требуется опция «Вставить канонический 
  ключ»; для тех, кто не беспокоится об атаках), и 2) Чат все еще может быть атакован. Туннели помогут справиться с обеими 
  проблемами, и по умолчанию будут использоваться только для предсказуемых ключей, поэтому сеть может работать 
  относительно медленнее, но без риска столкнуться с этими проблемами. Также продолжается работа над разными техниками, 
  например, позволить пользователям совершать безопасную повторную вставку (обновление) контента, или предотвратить 
  возможность для злоумышленника просмотреть запросы, совершенные пользователем до его подключения. Другой важный момент – 
  это работает, только если источник загружает в сеть новый контент или общается в чате на регулярной основе. Создание и 
  загрузка новых псевдонимов идентичности через короткие периоды времени, использование одиночных первичных вставок 
  (любого размера) с включенной опцией безопасного случайного ключа и дальнейшее объявление ключа – это должно быть 
  относительно безопасно для таких атак даже в сети опеннет, но смотрите выше про атаки при начальной загрузке.</li>

  <li><b>Анализ трафика</b>: Фринет обеспечивает минимальную защиту от глобального анализа трафика (набор базовых 
  сообщений и так далее); если злоумышленник также имеет узлы в сети, дополнительные данные, вероятно, будут полезны. Мы, 
  конечно, не гарантируем что невозможно отследить передачу данных между нод-узлами с подробными данными о трафике, однако 
  есть надежда, что это уронит оживленный нод-узел. Однажды мы реализуем стеганографию транспорта данных и/или опцию 
  поддержания постоянной скорости подключений для самых параноидальных пользователей. Обратите внимание, что в Tor-сетях 
  глобальный анализ трафика победит сеть полностью: все что требуется – наблюдать обе точки входа и выхода.</li>

  <li><b>Атаки обмена</b>: можно атаковать алгоритм определения расположения, и, таким образом нарушить маршрутизацию в 
  дружественных (friend-to-friend) сетях. Это было продемонстрировано авторами документа Pitch Black. Мы работаем над 
  решением, но к сожалению, на данный момент большинство пользователей используют опеннет.</li></ul>
      
  <p>Более подробная информация о текущем состоянии безопасности Фринет доступна <a href="https://wiki.freenetproject.org/Security_summary">здесь</a>.</p>
      
  <p><b id="flooding">Уязвим ли Фринет к флуд-атакам?</b><br>
  Короткий ответ: нет.</p>

  <p>Длинный ответ:<br>
  Мы так не думаем. Помимо защиты свободы слова, Фринет разработан также, как система эффективного динамического 
  кэширования. Если информация много запрашивается с ограниченного количества нод-узлов, нод-узлы участвующие в обработке 
  запросов будут кэшировать передаваемую информацию, снижая сетевую нагрузку. Если информация вставляется на ограниченном 
  наборе нод-узлов, и затем впоследствии часто запрашивается другим набором нод-узлов, с повторением, наборы будут 
  сближаться в топологии сети до тех пор, пока не станут «соседями», и только изначально целевые нод-узлы страдают от 
  атак.</p>
  
  <p>Другими словами, в целях навредить Фринет с помощью флуда, вам необходимо последовательно изменять точку входа в 
  сеть и постоянно вставлять и запрашивать новые данные, и этим вы всего лишь увеличите нагрузку на сеть рядом с вами. 
  Обладая огромной волей и мощностью, большей чем мощность всей сети, можно вывести из строя любую сеть общего 
  пользования (в том числе и сеть Интернет) с помощью флуд-атак, но мы намерены всегда хранить Фринет устойчивым к таким 
  атакам, насколько это теоретически возможно.</p>
  
  <p>Любопытно, что приведенный анализ относится только к <a href="https://wiki.freenetproject.org/Opennet">опеннет</a>, 
  в даркнет вы могли бы иметь несколько больший успех, хотя вам будет гораздо сложнее менять вашу точку входа 
  существенным образом. Тем не менее, у вас есть достаточно низкая пропускная способность (общее количество посещенных 
  нод-узлов в среднем около 20), и вы значительно ограничены числом нод-узлов для подключения, оно будет ниже для 
  даркнет.</p>
      
  <p><b id="hash">Для чего нужны хэш-ключи и шифрование данных, если оператор нод-узла может идентифицировать их (данные) в любом случае, если он попытается?</b><br>
  Хэширование ключа и шифрование данных не предназначены для защиты операторов нод-узлов Фринет от возможности выяснить 
  какого типа информация хранится на нод-узле, если они действительно хотят (в конце концов, они могут просто найти ключ 
  таким же образом, как и кто-то запрашивающий информацию), а скорее, чтобы держать операторов нод-узлов в неведении о 
  информации, которая хранится на их нод-узлах, если они не хотят о ней знать. Это отличие больше правовое, чем 
  техническое. Нереально ждать от оператора нод-узла, что он попытается постоянно собирать и/или угадывать возможные 
  ключи, а затем станет сверять их с информацией на своем нод-узле (даже если такая атака жизнеспособна с точки зрения 
  безопасности), поэтому здравомыслящее общество с меньшей вероятностью возложит ответственность на оператора нод-узла 
  за такую информацию в сети.</p>

  <p><b id="cancer">Что насчет враждебных «раковых» нод-узлов в сети?</b><br>
  Существование враждебных узлов в сети является наиболее сложной проблемой, с которой может столкнуться распределенная 
  сеть, и было причиной гибели многих прежних идей. Многие системы (такие как многопользовательские игровые сети) 
  стараются избегать вредоносных узлов, сохраняя протокол и код закрытыми, но нам еще предстоит увидеть пример такой 
  работы на длинной дистанции. И в любом случае это противоречит философии Фринет.</p>
  
  <p>Фринет основан на балансе положительных и отрицательных петель обратной связей, которые приносят запросы 
  информации, с нод-узлом, когда он функционирует хорошо, и прячет запросы от него, когда это не так. Способ избежать 
  «рака» (как и с телом) – обеспечить, чтобы эти петли могли корректно определить даже самый тщательно разработанный 
  злонамеренный нод-узел и не продолжали посылать ему запросы. Этот вопрос еще не решен окончательно в текущем тестовом 
  коде, но вы можете быть уверены, что в течение некоторого времени были рассмотрены и обсуждены разные возможные 
  решения. Некоторые из них были реализованы (обеспечение хэшей или сигнатур для контента, таблицы ошибок для нод-узлов, 
  отступание от нод-узла для вызова таймаутов…)</p>

  <p><b id="attackY">Что насчет атаки Y?</b><br>
  Фринет все еще находится в тестировании и обязательно будут обнаружены атаки, с которыми мы еще не имели дела. 
  Поэтому, если вам удастся выявить действительно новый тип атаки, мы заинтересованы узнать об этом. Пожалуйста, 
  помните, чем Фринет является и чем не является. Ни одна сеть не может предложить все и всем, и есть вопросы 
  безопасности, которыми сеть Фринет, по своей природе, не занимается в той мере, какую вы, возможно, можете желать. 
  Если это расстраивает вас, весь наш код находится в свободном доступе, поэтому вы можете взять из него столько, 
  сколько хотите и написать собственную распределенную сеть, соответствующую вашим ожиданиям.</p>

  <p><b id="privatedata">Что личная информация делает в хранилище Фринет? Как мне избавиться от этого? Как я могу защитить мои компьютер и безопасность при работе в сети Фринет?</b><br>
  Прежде всего, мы <b>настоятельно</b> рекомендуем вам устанавливать ПО Фринет на зашифрованный жесткий диск, например, 
  с помощью <a href="http://www.truecrypt.org/">Truecrypt</a>. Невозможно в ПО Фринет предотвратить все утечки личных 
  данных, особенно если вы загружаете мультимедийные файлы и так далее. Даже если вы только смотрите фрисайты и 
  используете плагины для общения, все еще остаются компрометирующие данные в вашем файле подкачки, которые должен быть 
  зашифрован (в последних версиях Windows вы можете попробовать команду "fsutil behavior set encryptpagingfile 1", но 
  на самом деле решение – шифровать всю систему, включая файл подкачки). Также важно, чтобы вы использовали браузер в 
  режиме конфиденциальности или с отключенными в настройках историей просмотров и кэшированием; мы пытаемся сделать 
  это, когда вы запускаете клиент Фринет через значок-иконку с кроликом, но нет никаких гарантий; к сожалению, эта 
  функциональная возможность, кажется, глючит с текущими версиями веб-браузеров. Плагины браузеров тоже могут быть 
  проблемой, и вы должны использовать отдельный браузер для Фринет при любых подозрениях. Будьте осторожны с файлами, 
  которые вы скачиваете в сети Фринет – они могут не только позволить захватить ваш компьютер любому желающему для 
  просмотра (медиа-файлы могут быть записаны на диск, даже если вы открываете их непосредственно в вашем веб-браузере и 
  никогда не сохраняете их), но также они могут содержать угрозу анонимности, например такую, как выход на вредоносный 
  веб-сайт и так далее; такое возможно для pdf-файлов и некоторых видео-форматов.  Фринет пытается предупредить вас об 
  этом, когда он не может отфильтровать вредоносный контент: в настоящее время ПО Фринет фильтрует страницы HTML, 
  графические форматы GIF/PNG/JPEG, CSS и MP3. Вскоре мы добавим поддержку Ogg и других форматов позже. И конечно, есть 
  много других угроз – вы должны принять стандартные меры предосторожности: не работать в операционных системах, 
  которые не обновляются, не запускать программное обеспечение из ненадежного источника, использование соответствующее 
  ПО для безопасности и так далее (если у вас есть брандмауэр, убедитесь, что он пропускает два UDP-порта, используемых 
  Фринет).</p>

  <p>Поскольку не все пользователи будут иметь зашифрованный диск для установки Фринет в первый раз, Фринет сам 
  пытается зашифровать все потенциально компрометирующие данные, которые хранятся на диске. О деталях ниже, но как уже 
  объяснялось, утечки неизбежны: вы действительно должны <a href="http://www.truecrypt.org/">шифровать свои диски!</a></p>

  <p>Основное хранилище данных не хранит данные, которые вы запрашивали или вставляли (или которые запрашивались или 
  вставлялись соседними нод-узлами), потому что он может быть изучен другими нод-узлами. Это было введено, чтобы 
  исправить <a href="http://www.theregister.co.uk/2005/05/13/freener_not_so_anonymous/">атаку</a>, опубликованную 
  The Register. Фринет имеет отдельный клиентский кэш, который хранит данные, которые вы недавно запрашивали, чтобы 
  избежать лишних обращений к сети каждый раз (что не только снизит скорость, но также и безопасность, поскольку 
  предоставит злоумышленникам больше возможностей видеть ваши запросы). Кроме того, Фринет хранит список ваших загрузок 
  и выгрузок (к которому вы можете обратиться, выбрав в меню пункт «Обмен файлами»), их текущий прогресс, а также 
  разные другие данные, в файле node.db4o (или node.db4o.crypt). Сами данные хранятся в persistent-temp-* каталоге. 
  Если вы не установили уровень физической безопасности на НИЗКИЙ, эти данные шифруются. На МАКСИМАЛЬНОМ уровне ключи 
  шифрования никогда не записываются на диск, поэтому данные эффективно уничтожаются при перезапуске нод-узла; в 
  противном случае ключи шифрования хранятся в файле master.keys (на ВЫСОКОМ уровне используется пароль). Вы можете 
  уничтожить данные с помощью тревожной кнопки на странице загрузок/выгрузок или надежно удалив файл master.keys. 
  Фринет также создает временные файлы temp-* в каталоге temp для других запросов, которые также зашифрованы, если 
  физический уровень безопасности НИЗКИЙ. Кроме того, некоторые плагины могут создавать собственные файлы данных, 
  которые могут содержать сообщения с вашими ответами или загруженные сообщения из форумов и чатов; в настоящее время 
  закладки и информация о недавно загруженных файлах все еще хранятся в виде обычного текста. Наше намерение – 
  переместить их в node.db4o или хранить их в отдельных зашифрованных базах данных, как только появится 
  автоматическое резервное копирование для node.db4o. Смотрите <a href="https://wiki.freenetproject.org/Program_files">здесь</a> 
  детали по некоторым файлам.</p>
  
  <p><b id="smartscreen">Фильтр Windows SmartScreen предупреждает, что установщик может нанести вред компьютеру. Что происходит?</b><br/>
  Фильтр <a href="http://windows.microsoft.com/en-us/windows7/smartscreen-filter-frequently-asked-questions-ie9">SmartScreen</a> 
  иногда ошибочно определяет файл установщика, как опасный. Мы считаем, что наш дистрибутив не инфицирован вредоносным 
  программным обеспечением, и если вы разработчик ПО, вы можете проверить исходный код установщика 
  <a href="https://github.com/freenet/wininstaller-innosetup">здесь</a>.</p>
