<h1>Общайтесь с нами в IRC</h1>

<p>Многих разработчиков и пользователей Фринет часто можно найти на <a href="https://en.wikipedia.org/wiki/IRC">IRC</a>-канале 
#freenet на сервере chat.freenode.net. Почти все посетители канала – волонтеры, и могут быть заняты другими делами, поэтому вы 
можете не получить ответ сразу: <b>Задайте свой вопрос или расскажите в чем заключается проблема, затем подождите несколько 
минут, и кто-то сможет вам помочь.</b>.</p>

<a href="https://webchat.freenode.net/?randomnick=1&channels=freenet">Общайтесь с нами</a>