<h2>Почтовые листы</h2>
      <p>
  Эти почтовые листы могут использоваться для поддержки или как источник информации о Фринет.
      </p>

      <h3>Подписка</h3>
      <p>
  Чтобы подписаться на один из листов, кликните на имя листа и на открывшейся странице в разделе 
  <span style="font-weight: bold;">Подписка на <Имя листа> (Subscribing to &lt;mailinglist&gt)</span> 
  введите ваш адрес электронной почты. Установка пароля опциональна - если вы оставите поле для 
  пароля пустым, пароль будет автоматически сгенерирован за вас. Далее нажмите кнопку <span style="font-weight: bold;">Подписаться (Subscribe)</span>. 
  Вскоре вы получите согласительное письмо с инструкциями; после выполнения инструкций, вы 
  будете получать письма из почтового листа.
      </p>

      <h3>Прекращение подписки</h3>

      <p>
  Чтобы прекратить подписку на какой-нибудь почтовый лист из вашей подписки, кликните на имя 
  листа и на открывшейся странице в разделе <span style="font-weight: bold;"><Имя листа> 
  Подписчики (&lt;mailinglist&gt; Subscribers)</span> нажмите кнопку <span style="font-weight: bold;">Прекратить 
  подписку или изменить настройки (Unsubscribe or edit options)</span>.
      </p>

      <p>
  <i><b>Замечание</b>: Замечание: мы постоянно получаем запросы от людей, которые хотят 
  прекратить подписку. </i><span style='text-decoration:underline;'>Вы</span><i> должны 
  сделать это сами! Просто перейдите по ссылке, предоставляемой внизу каждого письма, 
  введите ваш адрес электронной почты в текстовое поле в разделе «Подписчики» и введите 
  свой пароль. (Вы можете получить ваш пароль там же, в случае, если вы его забыли.)</i>
      </p>
      
      <h3>Листы</h3>
      
      <ul>
  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/announce/">Анонсы</a>
    (<a href="https://emu.freenetproject.org/pipermail/announce/">архив</a>)<br/>
    Подписывайтесь на этот лист, чтобы получать уведомления об важных моментах в развитии 
    Фринет, таких как выпуск новых версий программного обеспечения или исправление важных 
    ошибок. Этот лист модерируется и не создает много трафика (менее 1 сообщения в месяц).
  </li>

  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/">Поддержка</a>
    (<a href='https://emu.freenetproject.org/pipermail/support/'>архив</a>)<br/>
    Вопросы и ответы, касающиеся работы Фринет, сообщения об ошибках, а также предложения 
    по улучшению удобства использования. Скорее всего, просьбы о помощи будут услышаны 
    здесь, а не в других почтовых листах. <b>Примечание: </b> сообщения отправленные в 
    лист неподписанными пользователями должны пройти проверку, и до их публикации может 
    пройти несколько дней. Во избежание возможной задержки, пожалуйста, 
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/support/">подпишитесь</a>.
  </li>

  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/tech/">Техническая часть</a>
    (<a href="https://emu.freenetproject.org/pipermail/tech/">архив</a>)<br/>
    Этот лист предназначен для обсуждения технической стороны Фринет. Если вы хотите 
    обсудить долгосрочные технические идеи на тему Фринет, пожалуйста, используйте этот 
    лист.
  </li>

  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/devl/">Разработка</a>
    (<a href="https://emu.freenetproject.org/pipermail/devl/">архив</a>)<br/>
    Этот лист для активных разработчиков для обсуждения ошибок и реализации ближайших 
    новых возможностей Фринет. Пожалуйста, пишите в этот лист, только если вы 
    действительно знаете о чем говорите; иначе воспользуйтесь почтовым листом 
    «Техническая часть» (смотрите выше).
  </li>

  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/darknet-tools/">Даркнет-инструменты</a>
    (<a href="https://emu.freenetproject.org/pipermail/darknet-tools/">архив</a>)<br/>
    Почтовый лист для обсуждения и разработки способов и путей расширения даркнет, 
    сохраняя суть даркнет: плагины для общения, IRC-плагины, e-mail приглашения, 
    функционал нод-узла должен все это поддерживать; и любых других расширений для 
    даркнет, не нарушающих суть даркнет, так широко, насколько это возможно.
  </li>

  <li>
    <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/chat/">Чат</a> 
    (<a href="https://emu.freenetproject.org/pipermail/chat/">архив</a>)<br/>
    Этот лист для основных обсуждений Фринет и тем, которые не подходят для 
    остальных почтовых листов. Обсуждение политики, законов, философии, судебной 
    практики, языков программирования; технологий, которые не станут частью Фринет; 
    любых тем, которые разработчики и пользователи не сочли достойными основных 
    почтовых листов – все это обсуждается здесь. Вопросы такие как «Как я могу 
    предотвратить использование моего узла террористами?» или «Почему бы вам не 
    переписать Фринет на C++?» отправляйте в этот лист.
  </li>
      </ul>
      <p>
  <i><b>Инструменты сторонних проектов</b>: Мы предоставляем наш сервис почтовых 
  листов на нашем сервере нескольким сторонним проектам, вот <a href="https://emu.freenetproject.org/cgi-bin/mailman/listinfo/">полный 
  список</a> почтовых листов.</i>
      </p>