 <div id="people">

  <h1>Участники проекта</h1>
  <p><b>Замечание.</b> Приведен не полный список участников, в проект вовлечено 
  намного больше людей </p>

  <h5>Ян Кларк (Ian Clarke)</h5>
  <p>
    Фринет основан на работе Яна «Распределенная децентрализованная система хранения 
    и поиска информации». Ян начал проект Фринет в июле 1999 года, и продолжает 
    координировать проект. Также Ян основатель и главный исполнительный директор 
    компании <a href="http://sensearray.com/">SenseArray</a>.
  </p>
  
  <h5>Мэтью Тоселэнд (Matthew Toseland)</h5>
  <p>
    Мэтью начал работу над проектом Фринет со времен еще до релиза версии 0.5. Во 
    многом его стараниями были значительно увеличены производительность и 
    стабильность работы сети.
  </p>

  <h5>Оскар Сэндберг (Oscar Sandberg)</h5>
  <p>
    Оскар один из первых участников проекта Фринет и продолжает играть ключевую роль 
    в продолжающейся разработке.
  </p>

  <h5>Флоран Даньер (Florent Daigni&egrave;re)</h5>
  <p>
    Начав в 2003 году, Флоран улучшил различные аспекты программного обеспечения и 
    осуществляет системное администрирование проекта. На своей основной работе 
    Флоран технический директор <a href="https://www.trustmatta.com">Matta 
    Consulting</a>, престижной консалтинговой компании по вопросам безопасности.
  </p>

  <h5>Скотт Миллер (Scott Miller)</h5>
  <p>
    Скотт отвечает за реализацию большей части криптографии внутри Фринет.
  </p>

  <h5>Стивен Старр (Steven Starr)</h5>
  <p>
    Стивен помогает с управлением проектом Фринет Инк. Также он является советником 
    по вопросам бизнеса и рекламы.
  </p>

  <h5>Майкл Роджерс (Michael Rogers)</h5>
  <p>
    Майкл больше всех участвовал в подробном моделировании в рамках Google Summer of 
    Code. Он был полезен в проектировании 
    <a href="https://wiki.freenetproject.org/NewTransportLayer">нового 
      транспортного уровня</a>.
  </p>

  <h5>Дэйв Бэйкер (Dave Baker)</h5>
  <p>
    Основное занятие Дэйва <a href="freemail.html">Freemail</a>. 
    Его проект для Google Summer of Code – создать работоспособную систему 
    электронной почты для сети Фринет. Также Дэйв хорош в отладке и участвует 
    в ключевых работах в разных областях.
  </p>

  <h5>Роберт Хэйли</h5>
  <p>
    Роберт помог увеличить скорость и безопасность работы сети Фринет, выявив 
    <b>две серьезные ошибки</b>. В последнее время он программирует для проекта 
    отдельные части кода.
  </p>

  <h5>Дэвид Соудер (David Sowder)</h5>
  <p>
    Дэвид (Zothar) помогал проекту Фринет по мере свободного времени и желания. 
    Занимался вопросами конфигурации, статистики, FCP, FProxy статистикой, 
    обмена сообщениями между нод-узлами (N2NM/N2NTMs).
  </p>

  <p>
    И <b>сотни других</b>. Некоторые не пожелали оказаться в этом списке, 
    предпочитая оставаться неназванными. Других мы сами забыли упомянуть. 
    Не говоря уже о тысячах пользователей, тестеров 
    и <a href="sponsors.html">доноров</a>!
  </p>

      </div>