<h1> Философия Фринет </h1>
      <h6> Ян Кларк </h6>
      <p>
  <ol>
    <li><a href="#disclaimer">Отказ от ответственности</a></li>
    <li><a href="#prior_reading">Предварительно прочтите</a></li>
    <li><a href="#free_flow_info">Важность свободы информации</a></li>
    <li><a href="#censor_freedom">Цензура и свобода</a></li>
    <!-- to be continued... -->
    <li><a href="#solution">Решение</a></li>
    <li><a href="#is_censorship_necessary">Неужели цензура совсем не нужна?</a></li>
    <li><a href="#why_anonymity">Но для чего нужна анонимность?</a></li>
    <li><a href="#copyright">А что с авторским правом?</a></li>
    <li><a href="#rewarded">Но как творец будет вознагражден без авторского права?</a></li>
    <li><a href="alternative">Альтернативы авторскому праву</a></li>
  </ol>
      </p>

      <a name="disclaimer"><h3> 1. Отказ от ответственности</h3></a>
      <p>
  Есть много причин, по которым люди участвует в проекте Фринет. 
  Некоторые разделяют взгляды изложенные в этом документе; некоторые 
  имеют схожие взгляды, которые также служат тому, чего мы пытаемся 
  достичь. Эти идеи побудили меня спроектировать Фринет; необязательно, 
  что все вовлеченные в проект Фринет разделяют их.
      </p>
  
      <a name="prior_reading"><h3> 2. Предварительно прочтите </h3></a>
      
      <p>
  Для комфортного прочтения и понимания этого документа, вам, вероятно 
  потребуются некоторые знания о том, что такое Фринет. Вы можете 
  получить хорошее представление на странице 
  <a href="/whatis.html">«Что такое Фринет?»</a>.
      </p>
      
      <a name="free_flow_info"><h3> 3. Важность свободы информации </h3></a>
      
      <p>
  В большинстве западных культур, как правило, одним из самых важных прав 
  любого человека, считается свобода слова. Почему же свободный обмен 
  идеями и мнениями так важен? Есть несколько способов ответить на этот 
  вопрос. 
      </p>
      
      <h4> 3.1. Коммуникации – то, что делает нас людьми </h4>

      <p>
  Одним из наиболее очевидных различий между человечеством и остальной 
  частью животного царства является наша способность общаться используя 
  сложные и абстрактные понятия. В то же время мы постоянно обнаруживаем, 
  что коммуникативные способности у животных более сложны, чем 
  предполагалось ранее. Но маловероятно, что любое другое животное 
  приближается к нашему уровню способностей в этой области.
      </p>
      
      <h4> 3.2 Знания – добро </h4>
      
      <p>
  Большинство людей, если им предоставить возможность знать или не знать 
  что-то, выберут большее количество информации, а не меньшее. Войны 
  выигрывались и проигрывались в зависимости от того, кто был лучше 
  информирован. Это потому, что большая информированность позволяет 
  принимать лучшие решения и в целом улучшает нашу способность выживать 
  и быть успешным.
      </p>
      
      <h4> 3.3 Демократия предполагает хорошо информированное население </h4>

      <p>
  Многие люди сегодня живут в условиях демократического правительства, 
  другие, вероятно, хотят этого. Демократия – ответ на вопрос «как 
  создать лидеров, предотвращая злоупотребление лидерами властью». 
  Населению предоставляется право управлять правительством путем 
  голосования, но избирательное право не обязательно означает, что вы 
  живете в демократической стране. Для эффективного управления своим 
  правительством население должно знать, что делает правительство. 
  Население должно быть хорошо информировано. Эта обратная связь 
  может быть нарушена, если правительство контролирует доступность 
  информации для населения.
      </p>

      <a name="censor_freedom"><h3> 4. Цензура и свобода </h3></a>

      <p>
  Каждый ценит свою свободу. В действительности, многие считают 
  свободу настолько важной, что будут умирать за нее. Людям, 
  особенно в западных странах, нравится думать, что они свободны в 
  формировании мнения и в выборе мнений, которые им нравятся. 
  Рассмотрим такую ситуацию, кто-то имеет возможность контролировать 
  информацию, к которой вы имеете доступ. Это дает ему возможность 
  манипулировать вашим мнением, скрывая от вас некоторые факты, 
  предлагая вам ложь и информацию, которая прошла цензуру и не 
  противоречит лжи. Это не какая-то фантастика Оруэлла, это 
  стандартная практика для большинства западных правительств – лгать 
  своему населению. Лгать так, что люди сегодня воспринимают эту 
  ложь, как должное, несмотря на то, что это подрывает самые 
  демократические принципы, которые оправдывают существование 
  правительства прежде всего. 
      </p>

      <a name="solution"><h3> 5. Решение </h3></a>

      <p>
  Единственный способ гарантировать эффективность демократии – 
  обеспечение того, чтобы правительство не могло контролировать 
  возможности населения для общения, обмена информацией. Пока все, 
  что мы видим и слышим фильтруется, мы не истинно свободны. Цель 
  Фринет – обеспечить возможность общения и обмена информацией двум 
  или более желающим.
      </p>

      <a name="is_censorship_necessary"><h3> 6. Неужели цензура совсем не нужна? </h3></a>
      <p>
  Конечно, на такой вопрос нельзя ответить однозначно. Многие считают 
  цензуру хорошей вещью в некоторых обстоятельствах. Например, в некоторых 
  европейских странах распространение информации о расизме считается 
  незаконной. Правительства стремятся удерживать население от пропаганды 
  идей вредных для общества. Есть два взгляда.
      </p>
  
      <p>
  Взгляд первый. Вы не можете позволить власть имущим навязывать «хорошую 
  цензуру», не позволяя при этом навязывать также и «плохую цензуру». Для 
  наложения любой формы цензуры правительство должно иметь возможность 
  контролировать общение, тем самым общение ограничивая. Существует 
  критика антирасистской цензуры во многих европейских странах, так как 
  она препятствует законному историческому анализу событий, таких как 
  вторая мировая война.
      </p>

      <p>
  Взгляд второй. «Хорошая цензура» контрпродуктивна, даже когда она не 
  касается других областей и тем. Например, когда требуется убедить кого-то 
  в чем-то, будет эффективно в процессе убеждения так же привести возможные 
  аргументы против и ответить на них. К сожалению, незнание людьми часто 
  софистических аргументов расистов, делает людей уязвимыми, когда они в 
  конечном итоге сталкиваются с этими аргументами.
      </p>

      <p> 
  Конечно, первый взгляд является очень сильным, даже если вы не согласны 
  со вторым. В принципе, либо цензура существует, либо нет. Среднего быть 
  не может.
      </p>

      <a name="why_anonymity"><h3> 7. Но для чего нужна анонимность? </h3></a>

      <p>
  Вы не можете иметь полную свободу слова без возможности оставаться 
  анонимным. В основном цензура ретроспективна. Как правило, гораздо легче 
  ограничить свободу слова, наказывая вольнодумцев потом, а не мешая им 
  сейчас. Единственный способ избежать наказания – остаться неизвестным. 
  Существует распространенное заблуждение, что нельзя доверять анонимной 
  информации. Это не совсем верно. Используя цифровые подписи, люди могут 
  создавать защищенные анонимные псевдонимы, которым со временем люди 
  научатся доверять. Фринет включает механизм «подпространств» для 
  содействия этому.
      </p>
      
      <a name="copyright"><h3> 8. А что с авторским правом? </h3></a>

      <p>
  Много внимания паблисити Фринет сосредоточено вокруг вопроса об авторском
   праве. Отвечу кратко. Основная проблема с авторским правом заключается в 
   том, что правоприменительная практика требует мониторинг коммуникаций; а 
   вам не может быть гарантирована свобода слова, когда кто-то следит за 
   всем, что вы пишете и говорите. Это важно, большинство людей не замечают 
   и не учитывают этот момент при обсуждении вопроса об авторском праве, 
   поэтому хочу разъяснить:<br><br>
  <center>Вы не можете гарантировать свободу слова и соблюдение авторского 
  права.</center> 
      </p>
      
      <p>
  Именно по этой причине Фринет, предназначенный для защиты свободы слова, 
  должен препятствовать соблюдению авторского права.
      </p>

      <a name="reward"><h3> 9. Но как творец будет вознагражден без авторского права? </h3></a>
      
      <p>
  Во-первых, даже если бы авторское право было единственным возможным 
  вариантом, при котором творцы могут быть вознаграждены за свою работу; 
  я утверждаю, что свобода важнее, чем профессиональные творцы (кто 
  утверждает, что мы не имели бы искусства, не понимает смысла творчества: 
  люди будут создавать всегда, это принуждение. Вопрос лишь в том, смогут 
  ли они сделать это для жизни).
      </p>
      
      <p>
  Во-вторых, есть сомнения в эффективности авторского права сейчас. 
  Музыкальная индустрия сильно прибавила вместе с развитием технологий 
  связи, но по мнению многих музыкантов, которые должны были быть 
  вознаграждены авторским правом, оно не может это сделать. Скорее это 
  позволило посредникам получить контроль за распределением, в ущерб 
  как творцам, так и общественности.
      </p>
      
      <a name="alternative"><h3> 10. Альтернативы авторскому праву. </h3></a>
      
      <p>
  К счастью, авторское право никогда не наступит. Есть много других 
  способов вознаградить творчество. Самый простой – добровольная оплата. 
  Это расширенный вариант патронажной системы, которая часто 
  использовалась для вознаграждения творческих личностей еще до 
  появления авторского права. При такой системе богатый человек 
  финансирует художника, позволяя ему заниматься творчеством полный 
  рабочий день. Интернет предлагает интересное развитие этой идеи, где 
  вместо одного богатого покровителя сотни тысяч, выплачивающих 
  небольшие суммы через Интернет.
      </p>
      
      <p> 
  Мы сами практикуем то, что проповедуем. 15 марта 2001 года проект 
  Фринет начал принимать денежные дарения. В течение первой недели мы 
  собрали более $1000. 
      </p>