      <h1>Что такое Фринет?</h1>
      <blockquote>
	<i>«Я беспокоюсь о моем ребенке и Интернет все время, даже пока она слишком мала, чтобы зайти на форум. Вот что меня беспокоит. Я волнуюсь, что лет через 10-15 она придет ко мне и спросит: «Папа, где были вы, когда они забрали свободу у прессы в Интернет?»
	</i><br/>
	--Майк Годвин, <a href="https://www.eff.org/">Electronic Frontier Foundation</a>
      </blockquote>
    <p>Фринет – бесплатное программное обеспечение, позволяющее анонимно обмениваться файлами, просматривать и публиковать «фрисайты» (веб-сайты доступные только в сети Фринет), общаться на форумах не опасаясь цензуры.</p>
      
    <p>Фринет – децентрализованная сеть, что делает ее менее уязвимой для атак; при использовании режима «darknet» пользователи подключаются только к своим друзьям, что очень усложняет обнаружение.</p>
      
    <p>Коммуникации между узлами Фринет шифруются и передаются через другие узлы, поэтому крайне сложно определить кто запрашивает информацию и какую конкретно информацию.</p>
      
    <p>Пользователи вносят свой вклад в сеть Фринет, предоставляя пропускную способность и часть своего жесткого диска – «хранилище данных» для хранения файлов. Файлы автоматически хранятся или удаляются в зависимости от их популярности. Файлы с низким рейтингом удаляются, чтобы освободить место новому или более популярному контенту. Файлы шифруются, так что обычно пользователь не может легко определить какие данные содержатся в его хранилище; надеюсь, пользователь не может быть привлечен к ответственности за это. Чаты, форумы, сайты, функции поиска – все построено на базе этого распределенного хранилища данных.</p>
      
    <p>Программное обеспечение Фринет было скачано более 2 миллионов раз с начала проекта. Оно используется по всему миру для распространения информации минуя цензурные фильтры, включая Китай и другие страны Ближнего Востока. Идеи и концепции, впервые предложенные проектом Фринет, оказали заметное влияние в научном мире. Наша статья «Фринет: распределенная анонимная система хранения и поиска информации» была самой цитируемой работой по информатике 2000 года по версии CiteSeer. Фринет также вдохновил некоторые работы в областях права и философии. Ян Кларк, создатель и координатор проекта Фринет был выбран, как один из 100 лучших новаторов 2003 года техническим журналом MIT’s Technology Review.</p>

 	<p>Среди важных последних разработок проекта Фринет, стоит отметить режим «darknet». Мало какие другие сети поддерживают этот режим работы. При использовании режима «darknet», вы связываетесь только с доверенными узлами сети – друзьями. Это значительным образом снижает вашу уязвимость, но позволяет работать в глобальной сети через друзей друзей своих друзей и так далее. Это позволяет людям использовать Фринет даже в местах, где использование Фринет может быть незаконным. Делает блокирование информации очень сложным для правительств. Не полагается на туннельный доступ в «свободный мир».</p>
 	
 	<p>Звучит хорошо? <a href="download.html">Попробуйте сами!</a>
      </p>
